package 问题解决.欧拉计划;

public class e000 {
    /**
     *
     什么是欧拉计划？

     欧拉计划是一系列挑战数学、计算机编程的问题。虽然数学思维可以让你使用更为优雅的和有效的方法，但熟练掌握计算机编程技巧才能帮助你解决大部分问题。


     我已经写了一个程序，但它是否要运行几天才能得到答案？

     当然不必！每个问题都依据“一分钟原则”进行设计，这意思着，尽管可能要花几个小时来设计一个成功的算法去对付更加困难的问题，但一个高效实现的算法会允许普通电脑在一分钟内得到答案。


     如果我解决问题所花的时间多于一分钟，有关系吗？

     当然没关系，但是我们鼓励你回去改进你的方法。另外请留心，一旦你解决了一个特别的问题，你将可以获得关于这个问题的思路和其它解决这个问题的人的建议（实测，思路中很多是代码，C/C++，JAVA，python，等等，有些人甚至在 1 秒内解决了问题）。因此，我们鼓励你在题目帖的下方回复你的解题思路和代码。


     我通过搜索引擎解决了问题，有关系吗？

     我们鼓励你利用网络去研究一个问题，因为通过搜索引擎，你可能可以找到相关问题涉及到的更多数学知识。然而，如果你仅仅拷贝了问题的答案，你会获得什么呢？！
     */
}
